function information(val){
    let back = ["rgba(75, 0, 130, 0.9)", "rgba(199, 21, 133, 0.9)", "rgba(0, 128, 0, 0.9)", "rgba(128, 0, 0, 0.9)", "rgba(0, 0, 130, 0.9)", "rgba(128, 128, 0, 0.9)", "rgba(255, 140, 0, 0.9)"];
    
    let nameSectorBook = ["Гарри Поттер и Философский камень", "Гарри Поттер и Тайная комната", "Гарри Поттер и Узник Азкабана", "Гарри Поттер и Кубок огня", "Гарри Поттер и Орден Феникса", "Гарри Поттер и Принц-полукровка", "Гарри Поттер и Дары Смерти"];
    
    let imgSectorBook = ["img/book1.jpg", "img/book2.jpg", "img/book3.jpg", "img/book4.jpg", "img/book5.jpg", "img/book6.jpg", "img/book7.jpg"];
    
    let perevod = ["И. Оранский (РОСМЭН)<br>Мария Спивак (Махаон)",
    "М. Д. Литвинова (РОСМЭН)<br>Мария Спивак (Махаон)",
    "М. Д. Литвинова (РОСМЭН)",
    "М. Д. Литвинова (РОСМЭН)",
    "Виктор Голышев (РОСМЭН)<br>Леонид Мотылёв (РОСМЭН)<br>Владимир Бабков (РОСМЭН)<br>Мария Спивак (Махаон)",
    "Майя Лахути (РОСМЭН)<br>Сергей Ильин (РОСМЭН)<br>Мария Спивак (Махаон)",
    "Майя Лахути (РОСМЭН)<br>Мария Сокольская (РОСМЭН)<br>Сергей Ильин (РОСМЭН)<br>Мария Спивак (Махаон)"];

    let vipuschena = ['<p><img src="img/Flag_of_the_United_Kingdom.png" alt="">      26 июня 1997</p><p><img src="img/Flag_of_Russia.png" alt="">      13 октября 2000</p>',
    '<p><img src="img/Flag_of_the_United_Kingdom.png" alt="">      8 июля 1998</p><p><img src="img/Flag_of_Russia.png" alt="">      20 апреля 2001</p>',
    '<p><img src="img/Flag_of_the_United_Kingdom.png" alt="">      8 июля 1999</p><p><img src="img/Flag_of_Russia.png" alt="">      14 декабря 2001</p>',
    '<p><img src="img/Flag_of_the_United_Kingdom.png" alt="">      8 июля 2000</p><p><img src="img/Flag_of_Russia.png" alt="">      3 апреля 2002</p>',
    '<p><img src="img/Flag_of_the_United_Kingdom.png" alt="">      21 июня 2003</p><p><img src="img/Flag_of_Russia.png" alt="">      7 февраля 2004</p>',
    '<p><img src="img/Flag_of_the_United_Kingdom.png" alt="">      16 июля 2005</p><p><img src="img/Flag_of_Russia.png" alt="">      3 декабря 2005</p>',
    '<p><img src="img/Flag_of_the_United_Kingdom.png" alt="">      21 июля 2007</p><p><img src="img/Flag_of_Russia.png" alt="">      13 октября 2007</p>'];

    let izdatel = ['<p><img src="img/Flag_of_the_United_Kingdom.png" alt="">      Bloomsbury Publishing (2000)</p><p><img src="img/Flag_of_Russia.png" alt="">      РОСМЭН (2000)</p><p><img src="img/Flag_of_Russia.png" alt="">      Махаон (2013)</p>',
    '<p><img src="img/Flag_of_the_United_Kingdom.png" alt="">      Bloomsbury Publishing (2001)</p><p><img src="img/Flag_of_Russia.png" alt="">      РОСМЭН (2001)</p><p><img src="img/Flag_of_Russia.png" alt="">      Махаон (2014)</p>',
    '<p><img src="img/Flag_of_the_United_Kingdom.png" alt="">      Bloomsbury Publishing (2001)</p><p><img src="img/Flag_of_Russia.png" alt="">      РОСМЭН (2001)</p><p><img src="img/Flag_of_Russia.png" alt="">      Махаон (2014)</p>',
    '<p><img src="img/Flag_of_the_United_Kingdom.png" alt="">      Bloomsbury Publishing (2001)</p><p><img src="img/Flag_of_Russia.png" alt="">      РОСМЭН (2002)</p><p><img src="img/Flag_of_Russia.png" alt="">      Махаон (2014)</p>',
    '<p><img src="img/Flag_of_the_United_Kingdom.png" alt="">      Bloomsbury Publishing (2003)</p><p><img src="img/Flag_of_Russia.png" alt="">      РОСМЭН (2002)</p><p><img src="img/Flag_of_Russia.png" alt="">      Махаон (2014)</p>',
    '<p><img src="img/Flag_of_the_United_Kingdom.png" alt="">      Bloomsbury Publishing (2005)</p><p><img src="img/Flag_of_Russia.png" alt="">      РОСМЭН (2005)</p><p><img src="img/Flag_of_Russia.png" alt="">      Махаон (2015)</p>',
    '<p><img src="img/Flag_of_the_United_Kingdom.png" alt="">      Bloomsbury Publishing (2007)</p><p><img src="img/Flag_of_Russia.png" alt="">      РОСМЭН (2007)</p><p><img src="img/Flag_of_Russia.png" alt="">      Махаон (2015)</p>'];
    
    let nameSectorInfo = ["Гарри Поттер и Философский камень", "Гарри Поттер и Тайная комната", "Гарри Поттер и Узник Азкабана", "Гарри Поттер и Кубок огня", "Гарри Поттер и Орден Феникса", "Гарри Поттер и Принц-полукровка", "Гарри Поттер и Дары Смерти"];
    
    let informa = ["«Гарри Поттер и Философский камень» (англ. «Harry Potter and the Philosopher's Stone») — первый том в серии книг про юного волшебника Гарри Поттера. Автор книги — английская писательница Дж. К. Роулинг. Книга впервые была опубликована 26 июня 1997 года[1] Лондонским издательством Блумсбери, и по её мотивам был снят одноимённый фильм. В Америке и фильм, и книга появились под названием «Гарри Поттер и камень чародея» (англ. «Harry Potter and the Sorcerer's Stone») — по всей видимости, из-за опасений издателей по поводу того, что оригинальное название покажется юным американцам слишком сложным.[2] Вне зависимости от причин, перемена названия никак не сказалась на объёмах продаж. Спрос на книги про Гарри Поттера быстро возрос — казалось, юных читателей не напугали даже количество страниц, увеличивающихся от книге и книге, и постепенно усложняющийся сюжет. В России книга вышла лишь в октябре 2000 года[3]. Официальный перевод книги на русский язык осуществляло издательство «РОСМЭН», непосредственно перевод от И.В. Оранского (позднее был «подстроен» под перевод М.Д. Литвиновой). Начиная с марта 2013 года, книга издаётся издательством «Махаон» в переводе Марии Спивак[4].", 
     "«Гарри Поттер и Тайная комната» (англ. Harry Potter and the Chamber of Secrets) — вторая книга из серии романов о Гарри Поттере, автором которой является Дж. К. Роулинг. По книге был снят фильм. Книга была издана в 2001 году издательством «РОСМЭН», где переводилась М. Д. Литвиновой. В апреле 2014 года выпущено переиздание книги от издательства «Махаон», перевела книгу Мария Спивак.",
     "«Гарри Поттер и узник Азкабана» (англ. Harry Potter and the Prisoner of Azkaban) — третья книга серии романов о Гарри Поттере, автором которой является Дж. К. Роулинг. По сюжету книги был снят одноимённый фильм. Книга была издана издательством «Bloomsbury Publishing» 8 июля 1999 года в Великобритании. 14 декабря 2001 года она появилась на прилавках в России, изданная «РОСМЭНом» и переведённая М. Д. Литвиновой. В 2014 году выпущено переиздание книги от «Махаона», перевела книгу Мария Спивак.",
     "«Гарри Поттер и Кубок Огня» (англ. Harry Potter and the Goblet of Fire) — четвёртая книга о приключениях Гарри Поттера, написанная английской писательницей Дж.К. Роулинг. По книге был снят фильм. В 2002 году книга была удостоена премии «Хьюго»[1]. В России книга была издана в апреле 2002 года издательством «РОСМЭН», где переводилась М.Д. Литвиновой. В апреле 2014 года выпущено переиздание книги от «Махаона», перевела книгу Мария Спивак.",
     "«Гарри Поттер и Орден Феникса» (англ. Harry Potter and the Order of the Phoenix) — пятая книга английской писательницы Дж.К. Роулинг о Гарри Поттере. Является самой большой книгой Поттерианы, объёмом более 800 страниц, а также содержит наибольшее количество глав — 38. В России книга была издана в феврале 2004 года издательством «РОСМЭН», где над ней работал коллектив переводчиков: Леонид Мотылёв, Владимир Бабков, Виктор Голышев. В 2014 году выпущено переиздание книги издательством «Махаон», перевела книгу Мария Спивак.",
     "«Гарри Поттер и Принц-полукровка» (англ. Harry Potter and the Half-Blood Prince) — шестая книга из серии романов Джоан Роулинг о волшебнике-подростке Гарри Поттере. В книге описывается шестой год обучения героя в Хогвартсе. Книга вышла на английском языке 16 июля 2005 года, официальное русское бумажное издание вышло 3 декабря 2005 года, в издательстве РОСМЭН её переводили Сергей Ильин и Майя Лахути. Альтернативные переводы книги появились в сети Интернет летом 2005 года.",
     "«Гарри Поттер и Дары смерти» (англ. Harry Potter and the Deathly Hallows) — седьмая и последняя книга в серии романов Дж.К. Роулинг о Гарри Поттере. Джоан Роулинг закончила писать книгу 11 января 2007 года в отеле «Балморал» в Эдинбурге[1]. Было объявлено, что роман выйдет в свет 21 июля 2007 года в 00:01 по Гринвичу. Однако за пять дней до начала продаж книги в интернете появились фотографии и отсканированные изображения страниц американской редакции седьмой книги[2], которые оказались подлинными."];
    
    let cicata1 = ["<i>Всегда первыми жертвами становятся невинные. Так было много веков назад, так происходит и сейчас.</i>",
    "<i>Наши решения показывают, кем мы являемся в действительности, гораздо лучше, чем наши способности.</i>",
    "<i>Она умела видеть красоту в других, даже тогда, когда человек сам в себе этого не видел.</i>",
    "<i>Если боль ненадолго заглушить, она станет еще невыносимей, когда ты почувствуешь её вновь.</i>",
    "<i>Твои страдания доказывают, что ты остаешься человеком! Боль — удел человеческий...</i>",
    "<i>Обычное явление: тот, кто остался в живых, всегда чувствует себя виноватым.</i>",
    "<i>Это настоящее самоубийство! Сделай одолжение, мальчик, иди домой, поживи еще немного.</i>"];
    
    let cicata2 = ["<i>Всегда называй вещи своими именами. Страх перед именем усиливает страх перед тем, кто его носит.</i>",
    "<i>Знаменитый Гарри Поттер! Не успел войти в книжную лавку и тут же попал на первую страницу «Пророка»!</i>",
    "<i>Счастье можно найти даже в темные времена, если не забывать обращаться к свету.</i>",
    "<i>Мы сильны настолько, насколько мы едины, и слабы настолько, насколько разъединены.</i>",
    "<i>На свете нет ничего невозможного — дело только в том, хватит ли у тебя храбрости.</i>",
    "<i>Мы боимся неизвестности, когда смотрим на смерть и темноту, ничего более.</i>",
    "<i>Если не спросить — никогда не узнаешь, если знаешь — нужно лишь спросить.</i>"];

    document.querySelector('.sector-book-name').style.backgroundColor=back[val];
    document.getElementById('NameSectorBook').textContent=nameSectorBook[val];
    document.getElementById('ImgSectorBook').src=imgSectorBook[val];
    document.getElementById('Perevod').innerHTML=perevod[val];
    document.getElementById('Vipuschena').innerHTML=vipuschena[val];
    document.getElementById('Izdatel').innerHTML=izdatel[val];
    document.getElementById('NameSectorInfo').textContent=nameSectorInfo[val];
    document.getElementById('Informa').textContent=informa[val];
    document.getElementById('Cicata1').innerHTML=cicata1[val];
    document.getElementById('Cicata2').innerHTML=cicata2[val];
    document.querySelector(".information-book").style.visibility="visible";
}